# PathCannotBeClosedLoopPath3d Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..PathCannotBeClosedLoopPath3d Property
BuiltInFailures..::..SketchFailures Class See Also
---
Path cannot be a closed loop.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PathCannotBeClosedLoopPath3d { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathCannotBeClosedLoopPath3d As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PathCannotBeClosedLoopPath3d {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace